tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "sidneys/homebrew"
tap "wix/brew"
# Search tool like grep, but optimized for programmers
brew "ack"
# New file format for still image compression
brew "jpeg-xl"
# Download with resuming and segmented downloading
brew "aria2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# High performance key/value database
brew "berkeley-db", link: true
# GNU binary tools for native development
brew "binutils"
# Collection of portable C++ source libraries
brew "boost"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Like cat but displays content with syntax highlighting
brew "ccat"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Ruby environment tool
brew "chruby"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# .NET Core
brew "dotnet", link: false
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU implementation of which utility
brew "gnu-which"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Platform built on V8 to build network applications
brew "node"
# System monitoring dashboard for terminal
brew "gtop"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Popular GNU data compression program
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# Interactive computing in Python
brew "ipython", link: false
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab"
# LLVM's OpenMP runtime library
brew "libomp"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# GNOME XML library
brew "libxml2"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language
brew "lua"
# Bare libuv bindings for lua
brew "luv"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# GDI+-compatible API on non-Windows operating systems
brew "mono-libgdiplus"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Statically typed compiled systems programming language
brew "nim"
# Development kit for the Java programming language
brew "openjdk"
# Highly capable, feature-rich programming language
brew "perl"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Python version management
brew "pyenv"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Emulator for x86 and PowerPC
brew "qemu"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Apple simulator utilities
brew "wix/brew/applesimutils"
# Password manager that keeps all passwords secure behind one password
cask "1password", args: { appdir: "/Applications" }
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8", args: { appdir: "/Applications" }
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8-jre", args: { appdir: "/Applications" }
# Status bar app to overcome time-constrained WiFi networks
cask "airpass", args: { appdir: "/Applications" }
# Application launcher and productivity software
cask "alfred", args: { appdir: "/Applications" }
# Tools for building Android applications
cask "android-studio", args: { appdir: "/Applications" }
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Tool to hide status bar icons
cask "dozer", args: { appdir: "/Applications" }
cask "expo-xde", args: { appdir: "/Applications" }
# Web browser
cask "firefox", args: { appdir: "/Applications" }
# Screen color temperature controller
cask "flux", args: { appdir: "/Applications" }
cask "font-hack", args: { appdir: "/Applications" }
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Adds an OpenGL renderer to the ZDoom source port
cask "gzdoom"
# IDE for Java development - community edition
cask "intellij-idea-ce", args: { appdir: "/Applications" }
# System monitoring app
cask "istat-menus", args: { appdir: "/Applications" }
# Open-source screen recorder built with web technology
cask "kap", args: { appdir: "/Applications" }
# Sound clear in online meetings
cask "krisp", args: { appdir: "/Applications" }
# Open-source firewall to block unknown outgoing connections
cask "lulu", args: { appdir: "/Applications" }
# Minimal installer for conda
cask "miniconda", args: { appdir: "/Applications" }
# Collaboration platform for API development
cask "postman", args: { appdir: "/Applications" }
# Digital design and prototyping platform
cask "sketch", args: { appdir: "/Applications" }
# Team communication and collaboration software
cask "slack", args: { appdir: "/Applications" }
# Music streaming service
cask "spotify", args: { appdir: "/Applications" }
# Video game digital distribution service
cask "steam"
# Unpacks archive files
cask "the-unarchiver", args: { appdir: "/Applications" }
# Open-source BitTorrent client
cask "transmission", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Video communication and virtual meeting platform
cask "zoom", args: { appdir: "/Applications" }
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MenuBar Stats", id: 714196447
mas "MindNode", id: 1289197285
mas "Moom", id: 419330170
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Termius", id: 1176074088
mas "UTM", id: 1538878817
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
