# Homebrew Taps
tap "buo/cask-upgrade"           # Allows upgrading casks easily
tap "jorgelbg/tap"               # Pinentry-TouchID
tap "koekeishiya/formulae"       # Yabai, skhd
tap "FelixKratz/formulae"        # Sketchybar

# Bootstrap Essentials
brew "stow"                      # Symlink manager for dotfiles
brew "zsh"                       # Z shell for better terminal experience

# Essential Software
brew "htop"                      # Process viewer
brew "neofetch"                  # System information
brew "ripgrep"                   # Fast search tool
brew "fzf"                       # Fuzzy finder
brew "fd"                        # Modern alternative to `find`
brew "gnupg"                     # GPG for encryption
brew "git"                       # Version control

# Development Tools
brew "node"                      # JavaScript runtime
brew "deno"                      # Modern JavaScript/TypeScript runtime
brew "go"                        # Go programming language
brew "lua"                       # Lua programming language
brew "luarocks"                  # Lua package manager
brew "zig"                       # Zig programming language
brew "rust"                      # Rust programming language
brew "python"                    # Python programming language
brew "act"                       # Run GitHub Actions locally

# Infosec Tools
brew "nmap"                      # Network scanner
brew "hydra"                     # Password cracker
brew "john"                      # John the Ripper password cracker
brew "hashcat"                   # Advanced password recovery
brew "sqlmap"                    # SQL injection tool

# Terminal Tools
brew "btop"                      # Modern resource monitor
brew "tmux"                      # Terminal multiplexer
brew "neovim"                    # Modern Vim-based editor
brew "lolcat"                    # Rainbow text
brew "sl"                        # Train simulator (fun!)
brew "cowsay"                    # ASCII art
brew "figlet"                    # ASCII art text generator

# GUI Applications
cask "visual-studio-code"        # Code editor

# Mac App Store Applications
brew "mas"                       # Mac App Store CLI

# Window Management
brew "yabai"                     # Tiling window manager
brew "skhd"                      # Hotkey daemon
brew "sketchybar"                # Customizable macOS status bar

# Pinentry-TouchID
brew "pinentry-touchid"          # Use TouchID for GPG

# Shell Enhancement
brew "antidote"                  # Zsh plugin manager

